In [8]:
import pandas as pd
import numpy as np

## 데이터 불러오기

In [11]:
df = pd.read_csv('../docs/titanica.csv')

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
# 행, 열 출력
df.shape

(891, 12)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [24]:
df['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [25]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 정렬

In [26]:
# ascending= True(default) : 오름차순
df.sort_values(by='Age', ascending=False) # 내림차순

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

### 결측치 확인

In [28]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [30]:
# 결측치 있는 행 제거 (열 제거는 axis=1)
# 결측치 대체는 .fillna()
df.dropna(axis=0, inplace=True)

In [31]:
# 결측치 제거됨
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [33]:
# 인덱스가 순서가 이상함
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [35]:
# drop=Ture 기존 순서가 엉망인 인덱스가 새로운 컬럼으로 저장되지 않음
df.reset_index(drop=True, inplace=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
2,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
3,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
4,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

### 새로운 컬럼 생성
`Age`변수를 활용해서 나이대를 나타내는 변수를 생성해보자

In [38]:
df['Age'].value_counts(sort=True,ascending=False)

Age
36.0    11
24.0     9
19.0     6
35.0     6
49.0     5
        ..
6.0      1
57.0     1
43.0     1
11.0     1
26.0     1
Name: count, Length: 63, dtype: int64

In [39]:
# for문 이용

for i in range(df.shape[0]):
    if df.loc[i, 'Age'] < 10:
        df.loc[i, 'Age Group'] = '영유아'
    elif df.loc[i, 'Age'] < 20:
        df.loc[i,'Age Group']='10대'
    elif df.loc[i, 'Age'] < 30:
        df.loc[i,'Age Group']='20대'
    elif df.loc[i, 'Age'] < 40:
        df.loc[i,'Age Group']='30대'
    elif df.loc[i, 'Age'] < 50:
        df.loc[i,'Age Group']='40대'
    elif df.loc[i, 'Age'] < 60:
        df.loc[i,'Age Group']='50대'
    else: 
        df.loc[i,'Age Group']='60대 이상'

In [40]:
df['Age Group'].value_counts()

Age Group
30대       49
20대       36
40대       33
50대       24
10대       19
60대 이상    12
영유아       10
Name: count, dtype: int64

### 그룹으로 계산하기

In [43]:
df.groupby('Sex')['Survived'].value_counts()

Sex     Survived
female  1           82
        0            6
male    0           54
        1           41
Name: count, dtype: int64

In [44]:
df.groupby('Pclass')['Fare'].mean()

Pclass
1    88.683228
2    18.444447
3    11.027500
Name: Fare, dtype: float64

In [46]:
df.groupby(['Sex','Age Group'])['Survived'].value_counts()

Sex     Age Group  Survived
female  10대        1           13
        20대        1           19
                   0            2
        30대        1           25
        40대        1           11
        50대        1           10
                   0            2
        60대 이상     1            2
        영유아        0            2
                   1            2
male    10대        0            4
                   1            2
        20대        1            8
                   0            7
        30대        0           12
                   1           12
        40대        0           14
                   1            8
        50대        0            9
                   1            3
        60대 이상     0            8
                   1            2
        영유아        1            6
Name: count, dtype: int64